{
  "news": [
    {
      "title": "Moving Design Beyond Pictures",
      "link": "https://blog.angular.io/moving-design-beyond-pictures-1509c315f94e?source=rss----447683c3d9a3---4",
      "encoded": "Quickly create real Angular prototypes without writing code. Designers put a lot of time into designing components and features for their products, however there often still remains a gap between a designer’s vision and a developer’s reality."
    },
    {
      "title": "Version 6 of Angular Now Available",
      "link": "https://blog.angular.io/version-6-of-angular-now-available-cc56b0efa7a4?source=rss----447683c3d9a3---4",
      "encoded": "The 6.0.0 release of Angular is here! This is a major release focused less on the underlying framework, and more on the toolchain and on making it easier to move quickly with Angular in the future."
    },
    {
      "title": "Trip report from ng-conf 2018",
      "link": "https://blog.angular.io/trip-report-from-ng-conf-2018-1e8654053205?source=rss----447683c3d9a3---4",
      "encoded": "A few of the Angular team members were able to attend and present at ng-conf this year. We owe a huge thank you to the organizers for putting on such a great event."
    },
    {
      "title": "Top 3 Things Charter Learned About Reusable Designs and Components",
      "link": "https://blog.angular.io/top-3-things-charter-learned-about-reusable-designs-and-components-dd367de32122?source=rss----447683c3d9a3---4",
      "encoded": "This is a guest post by Geoffrey Cullins, Sr. Director, Portal App Development at Charter Communications. Modern web app development is complicated. Even when you go it alone, you’re faced with innumerable decisions. Which libraries and frameworks will you choose? How will you structure your code? What syntax rules will you follow? How will you build and deploy the app?"
    },
    {
      "title": "Trip report from ngAtlanta: Angular’s Roadmap, Inclusion, and more",
      "link": "https://blog.angular.io/trip-report-from-ngatlanta-angulars-roadmap-inclusion-and-more-b6c8bae85417?source=rss----447683c3d9a3---4",
      "encoded": "Last month I had the opportunity to speak at the ngAtlanta conference where I covered major parts of Angular’s 2018 roadmap and shared what I think is an interesting research-based rationale for focusing on diversity and inclusion as a strategy for productivity. You can check out the slides or watch my entire talk on YouTube."
    },
    {
      "title": "Run Angular CLI repos directly in your browser",
      "link": "https://blog.angular.io/run-angular-cli-repos-directly-in-your-browser-41332fd80901?source=rss----447683c3d9a3---4",
      "encoded": "Github is the source of truth for most Angular demos, examples, prototypes, and real world projects. However, downloading &amp; initializing these projects locally can take a looooong time- which makes them difficult to share with others. 😞"
    },
    {
      "title": "File uploads come to AngularFire",
      "link": "https://blog.angular.io/file-uploads-come-to-angularfire-6842352b3b47?source=rss----447683c3d9a3---4",
      "encoded": "Cloud Storage for Firebase is a serverless way to upload and download binary files straight from the browser. As of today, it’s officially supported by AngularFire. Adding AngularFire to your app allows you to easily and securely manage a Cloud Storage bucket. All without a line of server code."
    },
    {
      "title": "Schematics — An Introduction",
      "link": "https://blog.angular.io/schematics-an-introduction-dc1dfbc2a2b2?source=rss----447683c3d9a3---4",
      "encoded": "Schematics is a workflow tool for the modern web; it can apply transforms to your project, such as create a new component, or updating your code to fix breaking changes in a dependency. Or maybe you want to add a new configuration option or framework to an existing project."
    },
    {
      "title": "Stable AngularJS and Long Term Support",
      "link": "https://blog.angular.io/stable-angularjs-and-long-term-support-7e077635ee9c?source=rss----447683c3d9a3---4",
      "encoded": "AngularJS is planning one more significant release, version 1.7, and on July 1, 2018 it will enter a 3 year Long Term Support period."
    },
    {
      "title": "A Component Dev Kit for Angular",
      "link": "https://blog.angular.io/a-component-dev-kit-for-angular-9f06e3b4b3b4?source=rss----447683c3d9a3---4",
      "encoded": "Modern web development is all about components. Angular gives developers a way to define these discrete chunks of UI and then compose them into an application. We’ve built the Component Dev Kit (CDK) to provide high quality predefined behaviors for your components."
    }
  ]
}
